---
kind: method
id: M:Autodesk.Revit.DB.Structure.RebarShapeParameters.Dispose
source: html/4562ecf6-1ca3-61f5-e3d9-a4d0f4c0698c.htm
---
# Autodesk.Revit.DB.Structure.RebarShapeParameters.Dispose Method

Releases all resources used by the RebarShapeParameters

## Syntax (C#)
```csharp
public void Dispose()
```